function pow(x, y) {
    
    // Починаємо з 1, бо при множенні 1 нічого не змінює.
    // Це буде наш "накопичувач" результату.
    let result = 1;

    // Запускаємо цикл
    for (let i = 0; i < y; i++) {
        // На кожному колі множимо наш результат на x
        // Наприклад, для pow(2, 3):
        // 1 коло: 1 * 2 = 2
        // 2 коло: 2 * 2 = 4
        // 3 коло: 4 * 2 = 8
        result = result * x;
    }

    // Повертаємо готовий результат
    return result;
}

// Перевірка (виведе 8)
console.log(pow(2, 3)); 

// Перевірка (виведе 27, бо 3*3*3)
console.log(pow(3, 3));

// Перевірка (виведе 1, бо будь-що в степені 0 це 1)
console.log(pow(5, 0));